///////////////////////////////////////////////////////////////////////////////
//
// TITLE:       Rebf Based Bridge Interface
//
// DESCRIPTION:
//      This file defines the Rebf based bridge interface class
//
// COPYRIGHT:   Copyright (c) 2010
//              by GENERAL ELECTRIC COMPANY U.S.A.
//
// DOCUMENTATION:
//      b0BridgeRebf.vsd, b0BridgeRebf.xls
//
// ISSUES:
//      1) no bit in the control window to globally disable gate drive status
//          there are individual gate status masks which might meet the need
//
//      2) no bit in the control window to disable/bypass the gate sequencing
//         state machine that enforces min-on time, etc.
//
///////////////////////////////////////////////////////////////////////////////
#ifndef __B0_BRIDGE_REBF_H__
#define __B0_BRIDGE_REBF_H__



// Include Files
//--------------
// system
#include <string>
// core
#include "MonitorCommand.h"
// framework
#include "x0FrameWork.h"
#include "x0BridgeInterface.h"
#include "x0Hssl.h"
// product
#include "b0BrgFbkOffs.h"
#include "s0BrgSim.h"
#include "b0BridgeRebfFpga.inc"

// Constants
//----------
// bridge types supported by the bridge interface(BridgeType)

#define REBF_BRG_TYP_2LEVEL         (0)
#define REBF_BRG_TYP_2LEVEL_DB      (1)

// hssl window usage
#define REBF_NUM_OF_WIN             (3)     // number of windows needed
#define REBF_WIN_FBK                (0)     // window 0 = feedback data
#define REBF_WIN_CMD                (1)     // window 1 = command data
#define REBF_WIN_DIAG               (2)     // window 2 = diagnostic data

// board feedback offset
#define AEDB_VDC_FBK_OFFSET_FREQ    (20.0e3)// AEDB Board Vdc feedback offset frequency

// Types and Classes
//------------------





///////////////////////////////////////////////////////////////////////////////
//
// DESCRIPTION:
//   This class implements a high speed serial link interface to the
//   Rebf/HSLA bridge interface card set.
//   This card sets support 3-level IGCT bridges.
//
///////////////////////////////////////////////////////////////////////////////
class cBridgeRebf
{

//-----------------------------------------------------------------------------
public:
    friend class cVariable;
    friend class cParameter;
    friend class cDataPasser;
    friend class cMarkStatDiag;

    friend class cBridgeRebfTest;


    // Types
    //------
    struct InTyp
    {
        const unsigned&             Brg1EnableReq;      //  1 - bridge 1 enable request
        const PhsTransListTyp&      Brg1PhsTransList;   //  2 - bridge 1 phase transition list
        const PhsTransListTyp&      Brg1PhsDtransList;  //  3 - bridge 1 phase D transition list
        const unsigned&             FrameFrc;           //  4 - frc time for the upcoming frame boundary
        const unsigned&             FrameFrcZ;          //  5 - frc time for the current frame boundary
        const SysTm_Typ&            SysTm3;             //  6 - system time updated at Task3 rate
        const SysTm_Typ&            EventTm1;           //  7 - EventTm for Task1
        const unsigned&             ClearFltsT1;        //  8 - signal to reset latched faults in Task1
        const unsigned&             ClearFltsT3;        //  9 - signal to reset latched faults in Task3
        const unsigned&             OutRly101;          // 10 - signal to drive output relay 1 on IO 1
        const unsigned&             OutRly102;          // 11 - signal to drive output relay 2 on IO 1
        const unsigned&             OutRly103;          // 12 - signal to drive output relay 3 on IO 1
        const unsigned&             OutRly104;          // 13 - signal to drive output relay 4 on IO 1
        const unsigned&             OutRly105;          // 14 - signal to drive output relay 5 on IO 1
        const unsigned&             OutRly106;          // 15 - signal to drive output relay 6 on IO 1
        const unsigned&             OutRly107;          // 16 - signal to drive output relay 7 on IO 1
        const unsigned&             OutRly108;          // 17 - signal to drive output relay 8 on IO 1
        const unsigned&             OutRly109;          // 18 - signal to drive output relay 9 on IO 1
        cBrgFbkOffs&                Brg1FbkOffs;        // 19 - external bridge 1 feedback offset class
        cBrgFbkOffs&                Io1FbkOffs;         // 20 - external IO 1 feedback offset class
        const unsigned&             BrgCmdDb;           // 21 - fire Db1 request
        const unsigned&             ThermHi;            // 22 - 1=select High range for thermistor sensing, 0 = lo
        const float&                FanRef1;            // 23 - Fan#1 speed reference: <32 off, 32->255 0-100%
        const float&                FanRef2;            // 24 - Fan#2 speed reference: <32 off, 32->255 0-100%
        const unsigned&             MaskIocFlts;        // 25 - Mask A-B-C IOC  faults from setting fpga fault latch
        const unsigned&             IlimEnb;            // 26 - Enable fpga turn off of phase(s) with hi current
        const unsigned&             MaskDsatFlts;       // 27 - Mask A-B-C DSAT faults from setting fpga fault latch
        const unsigned&             BrgRdyLpTxDis;      // 28 - Disable brg ready loop FO Tx
        const unsigned&             RtrLoopFltEnb;      // 29 - Allow assertion of RtrLoop fault
        const unsigned&             OutLvRly01;         // 30 - signal to drive low-voltage output relay 01 on Rebf board
        const unsigned&             OutLvRly02;         // 31 - signal to drive low-voltage output relay 02 on Rebf board
        const unsigned&             OutLvRly03;         // 32 - signal to drive low-voltage output relay 03 on Rebf board
        const uint64_t&             T1FrameTm;          // 33 - time of next Task1 frame (cpu clock counts)
        const unsigned&             DisCmdNotFunc;      // 34 - Disable bridge request not working
        const volatile int&         T1wthnT3;           // 35 - T1 state within a T3 frame
        const unsigned&             InitDone;           // 36 - Signal to indicate initialization done
    };

    struct InsTyp
    {
        const float&                DelTm1;             //  1 - task1 period (sec)
        const float&                DelTm1Rcp;          //  2 - task1 frequency (tasks/sec)
        const float&                CpuCps;             //  3 - cpu cycles per second
        const unsigned&             SimMode;            //  4 - internal simulator mode
        const unsigned&             XSimMode;           //  5 - external simulator mode
                const unsigned&             DSimMode;           //  6  - dll simulator mode
        const unsigned&             AltCfg;             //  6 - configure parms for alternate(SEP,etc) operation
        const char*                 Uniquifier;         //  7 - class instance uniquifier string
        const unsigned&             PhsD1FltEnb;        //  8 - bridge 1 phase-D DSAT fault detection enable
        const unsigned&             Brg1InfcHdw;        //  9 - hardware connected to Bridge_1 connector
        const float&                ShuntRatBrg1;       // 10 - bridge 1 shunt current at 50 mV
        const float&                ShuntRatPhD;        // 11 - phase-D shunt current at 50 mV
        const unsigned&             Io1InfcHdw;         // 12 - hardware connected to I/O 1 connector
        const unsigned&             Io1AttenHdw;        // 13 - attenuator board connected I/O 1 voltage(low or high voltage input
        const float&                CtRatioIo1;         // 14 - CT ratio for I/O 1 current feedback
        const float&                LockOutTime;        // 15 - gating lock out time (seconds)
        const unsigned&             QntPerFrm;          // 16 - number of quants per task1 frame
        const unsigned&             Clk0PerQnt;         // 17 - number of clock-tics (or counts) in one quant
        const unsigned&             Clk0PerFrm;         // 18 - FRC counts in task 1 frame
        const unsigned&             HslaSite;           // 19 - HSLA site on the REBF board
        const int&                  TestMode;           // 20 - test mode
        const unsigned&             LineSide;           // 21 - Select Line converter fpga behavior
        const float&                DelTm3;             // 22 - task3 period (sec)
        const unsigned&             Io1RlyPwrChkInhReq; // 23 - Io1 relay pwr supply check inhibit request
        const float&                CpuCpsRcpUsec;      // 24 - Cpu clock period (usec)
        const int&                  TempVcoCalcSt;      // 25 - Vco temperature calculation state
                const int&                  TachPPR;            // 27 - Number of tachometer pulses per revolution
    };


    // Enumerations
    //-------------

    // rebf connectors sites for the hsla
    enum HslaSiteTyp
    {
        HSLA_SITE_JA1           = 0,
        HSLA_SITE_JA2           = 1
    };

    // hardware bridge interface boards (connected to Bridge_1(2) suppported by class
    enum BrgInfcHdwTyp
    {
        BRG_INFC_NONE           = 0,
        BRG_INFC_AEDBH1         = 1,
        BRG_INFC_AEDBH2         = 2,
        BRG_INFC_AEDBH3         = 3,
        BRG_INFC_AEDBH4         = 4,
        BRG_INFC_AEBIH1         = 5,
        BRG_INFC_AEBIH2         = 6,
        BRG_INFC_AEBIH3         = 7,
        BRG_INFC_RGIBH1         = 8
    };

    // hardware IO boards (connected to I/O 1 &2) suppported by class
    enum IoInfcHdwTyp
    {
        IO_INFC_NONE           = 0,
        IO_INFC_AEAAH1         = 1,
        IO_INFC_AEAAH2         = 2,
