///////////////////////////////////////////////////////////////////////////////
//
// TITLE        SimPlant1x
//
// DESCRIPTION
//      This file contains the definition for the class.
//
// COPYRIGHT    Copyright (c) 2010
//              by GENERAL ELECTRIC COMPANY U.S.A.
//
// DOCUMENTATION
//      s0SimPlant1x.cpp, s0SimPlant1x.xls, s0SimPlant1x.vsd
//
///////////////////////////////////////////////////////////////////////////////

#ifndef __S0_SIM_PLANT1X_H__
#define __S0_SIM_PLANT1X_H__


// Include Files
//--------------
// system
// core
// framework
#include "x0FrameWork.h"
// product
#include "Product.h"
#include "b0BridgeRebf.h"


// Constants
//----------
// Grid event simulation state
#define GEVT_REST   0
#define GEVT_READY1 1
#define GEVT_READY2 2
#define GEVT_CLOSE  3
#define GEVT_WAIT   4
#define GEVT_OPEN1  5
#define GEVT_OPEN2  6

// grid open simulation state
#define DEFAULTSEQUENCER    62
#define DEFAULTIYREF        63
#define GRID_SYMMETRIC      0
#define GRID_ASYMMETRIC     1
#define GRID_OPEN           2

//grid event
#define GRID_HVRT 3
#define GRID_REMSHORT 4
#define GRID_LOCSHORT 5
#define GRID_SCOMP 6
#define GRID_SCOMP_RS 7
//#define GRID_STAUP 6


// Function Prototypes
//--------------------


// Types and Classes
//------------------



///////////////////////////////////////////////////////////////////////////////
//
// DESCRIPTION
//      This class includes all the simulated models imported from DFIGe
//      latest V01.05.06A
//
///////////////////////////////////////////////////////////////////////////////
class cSimPlant1x
{

//-----------------------------------------------------------------------------
public:
    friend class cVariable;
    friend class cParameter;
    friend class cDataPasser;
    friend class cMarkStatDiag;

    // Types
    //------
    struct InTyp
    {
        // L bridge command
        const float&              L_VaBrgSim;           //  1  - line bridge l-n phase A voltage         (V l-n)
        const float&              L_VbBrgSim;           //  2  - line bridge l-n phase B voltage         (V l-n)
        const float&              L_VcBrgSim;           //  3  - line bridge l-n phase C voltage         (V l-n)
        const unsigned&           L_BrgPwrEnbT1;        //  4  - line side bridge power enable (from seq)
        const unsigned&           L_InnrRegEnbT1;       //  5  - line side inner regulator enable (from seq)
        // R bridge command
        const float&              R_VaBrgSim;           //  6  - rotor bridge l-n phase A voltage        (V l-n)
        const float&              R_VbBrgSim;           //  7  - rotor bridge l-n phase B voltage        (V l-n)
        const float&              R_VcBrgSim;           //  8  - rotor bridge l-n phase C voltage        (V l-n)
        const unsigned&           R_InnrRegEnbT1;       //  9  - rotor side inner regulator enable (from seq)
        // Contactor command
        const unsigned&           Q1Status;             //  10 - connection of line bridge is complete
        const unsigned&           S_SimK1ClsdT1;        //  11 - simulated Sync Contactor state for generator model
        const unsigned&           KdfClsCmd;            //  12 - Distortion filter close command
        //const unsigned&           L_CcstrClsCmd;        //  13 - charger contactor close command
        const unsigned&           spare1;               //  13 - spare1
        const unsigned&           AcLineIp;             //  14 - Ac line voltage is developing
        const unsigned&           L_AcLinePres;         //  15 - ac line voltage is present on line bridge
        // Other inputs
        const float&              IdbTot;               //  16 - dynamic brake total current sum of two DB currents(Amp)
        const float&              L_D_PwL_RTot;         //  17 - line bridge total diode power loss (upper and lower) (watts)
        const float&              L_BrgLossPwr;         //  18 - line bridge power loss                  (watts)
        const float&              R_BrgTotalPwr;        //  19 - rotor bridge total active power flow    (Watts)
        const float&              PwrBatChpr;           //  20 - battery chopper power 
        // Misc
        const unsigned&           GmRevSeq;             //  21 - reverse phase sequence boolean
        const unsigned&           InitDone;             //  22 - init finished
        const float&              R_LT1TmDelta;         //  23 - time delta between rotor & line task1 (sec)
        const unsigned&           FuseOpen; 
        const unsigned&           FuseArc;
        const float&              FuseVaArc;
        const float&              FuseVbArc;
        const float&              FuseVcArc;
    };

    struct InsTyp
    {
        // system rating
        const float&               TurbineNpRat;        //  1  - Turbine name plate power (watts)
        const float&               SysVoltNom;          //  2  - System voltage nominal (Vrms)
        const float&               SysFreqNom;          //  3  - System frequency nominal (Hz)
        // grid
        const float&               ShrtMVA;             //  4  - Grid short circuit capacity
        const float&               GridXOR;             //  5  - Grid XoR
        // Xfmr
        const float&               VxfmrPri;            //  6  - xmfr primary voltage (from product)     (volt)
        const float&               LxfmrPri;            //  7  - xmfr primary inductance (from product)  (Henrys)
        const float&               RxfmrPri;            //  8  - xmfr primary resistance (from product)  (Ohm)
        const float&               L_VxfmrSec;          //  9  - xmfr secondary line converter winding voltage (from product)  (volt)
        const float&               L_LxfmrSec;          //  10 - xmfr secondary line converter winding inductance (from product) (Henrys)
        const float&               L_RxfmrSec;          //  11 - xmfr secondary line converter winding resistance (from product)  (Ohm)
        // generator
        const float&               S_RRatio;            //  12 - Vs/Vr at zero spd
        const float&               R_RPMNom;            //  13 - motor nominal speed (i.e. RPM at which nominal torque yields nominal power) (RPM)
        const float&               R_PolePairs;         //  14 - generator pole pair
        const float&               S_Ls;                //  15  - L stator  refered to stator             (Henrys)
        const float&               S_Lr;                //  16  - L rotor  refered to stator              (Henrys)
        const float&               S_R1;                //  17 - r1, stator resistance                   (Ohm)
        const float&               S_R2;                //  18 - r2, stator resistance                   (Ohm)
        const float&               S_LmNom;             //  19 - nominal value of S_Lm                   (Henrys)
        const float&               Imped_Scl;           //  20  - impedance scaling for delta and wye connection
        const float&               R_SpdRefSim;         //  21  - simulator speed "nip"                  (rad/sec)
        // converter
        const float&               L_Rdf;               //  22 - distortion filter resistance           (Ohm)  
        const float&               L_Cdf;               //  23 - distortion filter capacitance           (Farad) 
        const float&               L_CTot;              //  24 - line total source capacitance           (Henrys)
        const float&               L_RTot;              //  25 - line total input resistance             (Ohm)
        const float&               L_LTot;              //  26 - line total input inductance             (Farad)
        const float&               L_RBldCap;        //  27 - DC link capacitor leakage resistance    (1/Ohm)
        const float&               L_RChg;              //  28 - line bridge charge resistor             (Ohm)
        const float&               L_VdcMax;            //  29 - maximum allowed Vdc level (volts)
        // time step
        const float&               L_DelTm1;            //  30 - line task 1 delta time                  (sec)
        const float&               L_DelTm1Rcp;         //  31 - line task 1 delta time reciprocal       (1/sec)
        const float&               R_DelTm1;            //  32 - rotor task 1 delta time                 (sec)
        const float&               R_DelTm1Rcp;         //  33 - rotor task 1 delta time reciprocal      (1/sec)
        // Misc
        const unsigned&            GEvtEnbSim;           //  34 - Enable the grid event simulation             
        const unsigned&            L_RevSeqReq;         //  35 - reverse sequence request
        
        const float&               L_IocThrs;
    };

    cSimPlant1x( InTyp InList, InsTyp InsList );
   ~cSimPlant1x();

    // Methods
    //--------
    int  RunRules(void);
    void Task1(void);
    void Task1A(void);

    // Output Signals
    //---------------

    CREATE_PUBVAR(L_VabBrgSim       ,float);            // line bridge voltage A to B feedback simulated (volt l-l)
    CREATE_PUBVAR(L_VbcBrgSim       ,float);            // line bridge voltage B to C feedback simulated (volt l-l)

    CREATE_PUBVAR(L_VanBrgSim       ,float);            // line bridge voltage A to B feedback simulated (volt l-l)
    CREATE_PUBVAR(L_VbnBrgSim       ,float);            // line bridge voltage B to C feedback simulated (volt l-l)
    CREATE_PUBVAR(L_VcnBrgSim       ,float);            // line bridge voltage B to C feedback simulated (volt l-l)
